<template>
  <my-hero />
  <swiper-section :list="list" />
  <my-quote
    :text="'Усі митці в світі цім люди, а чи всі люди в світі цім митці'"
    :author="'Невідомий поет'"
  />
  <swiper-section :list="list" />
  <poem />
</template>

<script setup>
import MyHero from "../components/Hero/MyHero.vue";
import SwiperSection from "../components/SwiperSection/SwiperSection.vue";
import Poem from "../components/Poem/Poem.vue";
const list = [
  {
    title: "Слова надіі",
    _id: "1",
    date: "22-02-2021",
    text: `Хотіли люди собою бути<br>
А їм дороги не дали<br>
Нехай лунає відовсюду<br>
Що тут немає доброти<br>
Нехай усі про все все знають<br>
Нехай хочь і в глуші<br>
Настане ніч ніч жалю<br>
коли усі побіжуть в кущі`,
    poster: `Хотіли люди собою бути<br>
А їм дороги не дали<br>
Нехай лунає відовсюду<br>
Що тут немає доброти<br>
Нехай усі про все все знають<br>
Нехай хочь і в глуші...<br>`,
  },
  {
    title: "",
    _id: "2",
    date: "22-02-2021",
    text: `За щастя можу відповісти
  За кохання можу сісти
  За твоі очі неймовірні
  Можу гору зрушити з місця
  За твій легкий дотепний говір
  Я б поіхав у Житомир`,
    poster: `За щастя можу відповісти<br>
  За кохання можу сісти<br>
  За твоі очі неймовірні<br>
  Можу гору зрушити з місця<br>
  За твій легкий дотепний говір<br>
  Я б поіхав у Житомир...`,
  },
  {
    title: "",
    _id: "3",
    date: "22-02-2021",
    text: `За щастя можу відповісти
  За кохання можу сісти
  За твоі очі неймовірні
  Можу гору зрушити з місця
  За твій легкий дотепний говір
  Я б поіхав у Житомир`,
    poster: `За щастя можу відповісти<br>
  За кохання можу сісти<br>
  За твоі очі неймовірні<br>
  Можу гору зрушити з місця<br>
  За твій легкий дотепний говір<br>
  Я б поіхав у Житомир...`,
  },
  {
    title: "",
    _id: "4",
    date: "22-02-2021",
    text: `За щастя можу відповісти
  За кохання можу сісти
  За твоі очі неймовірні
  Можу гору зрушити з місця
  За твій легкий дотепний говір
  Я б поіхав у Житомир
  Щоб нарвати тобі квітів
  Духмяних, жовтих, синіх, літніх`,
    poster: `За щастя можу відповісти<br>
  За кохання можу сісти<br>
  За твоі очі неймовірні<br>
  Можу гору зрушити з місця<br>
  За твій легкий дотепний говір<br>
  Я б поіхав у Житомир...`,
  },
];
</script>

<style lang="css" scoped></style>
